import pygame
import random
from gameobject import GameObject

genders = ("чоловік", "жінка")
male_names = ("Микола", "Богдан", "Петро", "Степан", "Іван", "Дмитро", "Андрій", "Артем", "Денис", "Максим")
female_names = ("Оксана", "Ірина", "Василина", "Олена", "Тетяна", "Анна", "Катерина", "Діана", "Поліна", "Анастасія")
descriptions=("Ти працюєш менеджером по роботі з клієнтами у банку, любиш сучасні гаджети, ненавидиш спорт, весь вільний час зависаєш у соціальних мережах. ",\
            "Ти працюєш у сфері туризму, обожнюєш подорожі, зберігаєш сувеніри з кожної країни, але терпіти не можеш організовувати свої валізи.", \
            "Ти викладач історії, любиш стародавні цивілізації, захоплюєшся філософією та постійно ведеш суперечки про правильність трактувань подій.",\
            "Ти працюєш фронтенд-розробником, любиш проходити тренінги і навчання, у тебе майже нема вільного часу.",\
            "Ти власник невеликого квіткового магазину, обожнюєш доглядати за рослинами, часто вигадуєш нові композиції, але не любиш спілкування з примхливими клієнтами.",\
            "Ти лікар-хірург, працюєш за суворим графіком, обожнюєш тишу після роботи, але відчуваєш себе ніяково під час вечірок.",\
            "Ти молодий письменник, обожнюєш вигадувати фантастичні сюжети, полюбляєш каву з корицею, але часто відкладаєш дедлайни на останній момент.",\
            "Ти дизайнер інтер'єрів, любиш поєднувати кольори й фактури, обожнюєш сучасний мінімалізм, але терпіти не можеш робити однакові проєкти.",\
            "Ти студент-медик, любиш біологію та анатомію, завжди носиш із собою конспекти, але ненавидиш працювати з паперовими документами.",\
            "Ти професійний фотограф, який полює за ідеальним кадром, обожнює заходи сонця, але тебе дратує, коли хтось неправильно користується камерою.",\
            "Ти шеф-кухар у престижному ресторані, експериментуєш зі смаками, мрієш створити ідеальну страву, але не терпиш, коли клієнти додають кетчуп до твоїх творінь.",\
            "Ти археолог, проводиш місяці в експедиціях, обожнюєш запах старовинних книг, але боїшся павуків, які часто трапляються у твоїх розкопках."\
            )

manners_of_speech=("Твій словниковий запас бідний, ти часто вживаєш слова-паразити на кшталт 'типу', 'ну' тощо, ти повільно і важко висловлюєш думки.",\
            "Ти говориш дуже швидко, не можеш утримувати увагу на одній темі, постійно намагаєшмя змінити тему розмови.", \
            "Ти говориш витончено, складними реченнями, дипломатично оминаєш незручні теми, використовуєш багато рідкісних слів на кшталт 'амбівалентно', 'кореляція', 'променада' тощо.",\
            "Ти говориш із нотками зверхності, ніби завжди вважаєш свою думку правильною.",\
            "Ти використовуєш риторичні запитання, часто звертаєшся до слухача, щоб залучити його до розмови.",\
            "Ти використовуєш безліч жартів і анекдотів, щоб розрядити атмосферу або привернути увагу.",\
            "Ти говориш повільно і обдумано, кожне слово вимовляєш чітко. Твоя манера спілкування створює враження, що ти завжди знаєш, про що говориш, і не поспішаєш. Ти часто робиш паузи, щоб дати співрозмовнику можливість осмислити сказане.",\
            "Ти говориш з великою емоційною виразністю, використовуєш жести і інтонації, щоб підкреслити свої слова. Твоя манера спілкування захоплює слухачів, але іноді може здаватися надто театральною.",\
            "Ти часто використовуєш сарказм і іронію у своїй мові. Твої коментарі можуть бути дотепними, але іноді вони можуть образити співрозмовників. Ти любиш підкреслювати абсурдність ситуацій, в яких опиняєшся.",\
            "Ти використовуєш багато термінів і спеціалізованої лексики, що може бути важко зрозуміти людям, які не знайомі з твоєю професією. Твоя манера спілкування може здаватися холодною, але ти просто намагаєшся бути точним.",\
            "Ти часто вагаєшся у своїх словах, використовуєш запитання і фрази на кшталт 'можливо' або 'я не впевнений'. Твоя манера спілкування може створювати враження, що ти не впевнений у своїх думках.",\
            "Ти часто говориш неясно, залишаючи багато питань без відповідей. Твоя манера спілкування може бути інтригуючою, але іноді викликає розчарування у співрозмовників, які хочуть зрозуміти твої думки.",\
            "Ти говориш мало, але коли говориш, твої слова завжди мають вагу. Ти вважаєш, що краще слухати, ніж говорити, і часто ставиш запитання, щоб дізнатися більше про інших."\
            )

#клас AI персонажів
class AICharacter(GameObject):
    tile = ""
    sprite = None
    name = "Anonymous"
    age = 20
    gender = "male"
    description = ""
    manner_of_speech = ""
    trust = 0 #довіра до гравця
    consent = 0 #готовність до компромісу

    #конструктор
    def __init__(self, x,y,w,h,tile=""):
        GameObject.__init__(self,x,y,w,h)
        self.tile = tile
        if tile!="":
            self.sprite = pygame.image.load(tile) #завантаження спрайту
        self.generate()

    #згенерувати випадкового персонажа
    def generate(self):
        self.gender = random.choice(genders)
        self.age = random.randint(10, 65)
        if self.gender == "чоловік":
            self.name = random.choice(male_names)
        else:
            self.name = random.choice(female_names)
        self.description = random.choice(descriptions)
        self.manner_of_speech = random.choice(manners_of_speech)


    def get_prompt(self):
        return "Ти персонаж рольової гри." + \
            "Ім'я: " + self.name + \
            ". Вік: " + str(self.age) + \
            ". Гендер: " + self.gender + \
            ". Особистість: " + self.description + \
            " Манера говорити: " + self.manner_of_speech + \
            " У тебе є конфлікт з третім ігровим персонажем, який гравець намагається допомогти вирішити." + \
            " У тебе два основних ігрових показники: ДОВІРА і ГОТОВНІСТЬ ДО КОМПРОМІСУ у цьому конфлікті" +\
            " Твій рівень ДОВІРИ до головного гравця виражається числом від 0 до 100." + \
            " Твоя ГОТОВНІСТЬ ДО КОМПРОМІСУ в конфлікті виражається числом від 0 до 100. " + \
            " '\nПравила ведення діалогу: "+ \
            " \n1. Залежно від реплік гравця ти можеш змінювати рівень ДОВІРИ у межах 10%." + \
            " \n2. Якщо ДОВІРА більше 30, ти можеш змінювати ГОТОВНІСТЬ ДО КОМПРОМІСУ у межах 10%, за умови, що аргументи гравця для тебе переконливі. Величина зміни ГОТОВНОСТІ ДО КОМПРОМІСУ залежить від рівня ДОВІРИ."+ \
            " \n3. Якщо ДОВІРА низька, ти будеш схильний уникати контакту й говоритимеш мало, а при високій ДОВІРІ будеш більш говіркий і будеш здатен змінювати ГОТОВНІСТЬ ДО КОМПРОМІСУ." +\
            " \n4. Ти готовий говорити про конфлікт виключно якщо рівень ДОВІРИ більше 15.\n"

    #змінити рівень довіри
    def change_trust(self, trust):
        self.trust+=trust
        if self.trust < 0:
            self.trust = 0
        if self.trust > 99:
            self.trust = 99
    #змінити готовність до компромісу
    def change_consent(self, consent):
        self.consent+=consent
        if self.consent < 0:
            self.consent = 0
        if self.consent > 99:
            self.consent = 99

    #малювання персонажа
    def draw(self, screen, offset_x, offset_y):
        if self.tile=="":
            pygame.draw.rect(screen, self.color, (self.x+offset_x, self.y+offset_y, self.width, self.height))
        else:
            screen.blit(self.sprite, (self.x+offset_x, self.y+offset_y))
        pygame.draw.rect(screen, (100, 100, 100), (self.x + offset_x, self.y + offset_y - 6, self.width, 3, ))
        pygame.draw.rect(screen, (0, 255, 0), (self.x + offset_x, self.y + offset_y - 6, self.width*self.trust/100, 3))
        #pygame.draw.rect(screen, (200, 200, 200), (self.x + offset_x, self.y + offset_y - 10, self.width, 3), width=1)
        pygame.draw.rect(screen, (0, 100, 255),(self.x + offset_x, self.y + offset_y - 10, self.width * self.consent / 100, 3))
