from aicharacter import AICharacter
import random

conflict_descriptions=("p1 і p2 працюють у спільному офісі. p1 любить слухати музику під час роботи, але p2 вважає це надмірно відволікаючим і наполягає на тиші.",\
            "p1 і p2 обговорюють місце для відпустки. p1 хоче провести її в горах для активного відпочинку, а p2 наполягає на пляжному курорті, щоб розслабитися.", \
            "p1 і p2 обговорюють вибір подарунка для їх спільної подруги. p1 хоче подарувати дорогий і символічний подарунок, але p2 наполягає на практичному та бюджетному варіанті.",\
            "p1 і p2 організовують вечірку. p1 хоче запросити багато друзів і зробити її масштабною, а p2 вважає, що краще зосередитися на невеликій та затишній компанії.",\
            "p1 і p2 сперечаються про дизайн нового логотипу. p1 наполягає на яскравих і сучасних елементах, а p2 віддає перевагу мінімалізму та стриманим кольорам.",\
            "p1 і p2 сперечаються про вибір фільму для перегляду: p1 наполягає на драмі з глибоким сюжетом, тоді як p2 хоче подивитися легку комедію для підняття настрою."\
            )
#клас конфлікту
class Conflict:
    side1=None #сторона конфлікту 1
    side2 = None #сторона конфлікту 2
    description = ""
    def generate(self):
        self.description = random.choice(conflict_descriptions)
        self.description = self.description.replace("p1", self.side1.name).replace("p2", self.side2.name)
    def __init__(self, s1:AICharacter, s2:AICharacter):
        self.side1, self.side2 = s1,s2
        self.generate()